app/Controllers/Dashboard/Profile.php

  public function index()
  {
    $form = $this->request->getPost();
    $data = [
      'title'      => 'Profile',
      'app'        => $this->app,
      'user_login' => $this->user_login,
      'pesan_ttl'  => $this->pesan_total,
      'kelas'      => $this->kelasM->find(),
---
SELECT *
FROM `kelas`
WHERE `kelas`.`deleted_at` IS NULL

      $save['foto'] = $nameimg;
    }

    $this->userM->save($save);
---
UPDATE `user` SET `username` = 'Admin', `email` = 'Admin@email.com', `fullname` = 'Admin', `alamat` = 'Jalan', `updated_at` = '2024-07-09 00:09:33'
WHERE `user`.`id` IN ('5')