app/Controllers/Dashboard/Admin/Home.php

SELECT COUNT(*) AS `numrows`
FROM `user`
WHERE `role` = 'anggota'
AND `user`.`deleted_at` IS NULL
SELECT COUNT(*) AS `numrows`
FROM `buku`
WHERE `buku`.`deleted_at` IS NULL
SELECT COUNT(*) AS `numrows`
FROM `peminjaman`
WHERE `status` IN ('1','0')
AND `peminjaman`.`deleted_at` IS NULL
SELECT COUNT(*) AS `numrows`
FROM `peminjaman`
WHERE `status` = '2'
AND `peminjaman`.`deleted_at` IS NULL
---
    public function index()
    {
        $data = [
            'title'      => 'Home',
            'app'        => $this->app,
            'user_login' => $this->user_login,
            'pesan_ttl'  => $this->pesan_total,
            'notif' => $this->notifM
                ->whereIn('level_akses', ['0', '2'])
                ->where('status', '1')
                ->find(),
        ];

        $data['user'] = $this->userM
            ->where('role', 'anggota')
            ->countAllResults();
        $data['buku'] = $this->bukuM
            ->countAllResults();
        $data['pinjaman'] = $this->peminjamanM
            ->whereIn('status', ['1', '0'])
            ->countAllResults();
        $data['pengembalian'] = $this->peminjamanM
            ->where('status', '2')
            ->countAllResults();