app/Controllers/Dashboard/Admin/Laporan.php

  public function pinjaman()
  {
    $form = $this->request->getPost();

    $data = [
      'title'      => 'Peminjaman',
      'app'        => $this->app,
      'user_login' => $this->user_login,
      'pesan_ttl'  => $this->pesan_total,
    ];

    $data['pinjaman'] = $this->peminjamanM
      ->select('peminjaman.*, user.fullname, user.username, buku.judul')
      ->join('buku', 'buku.id = peminjaman.buku_id')
      ->join('user', 'user.id = peminjaman.user_id')
      ->whereIn('status', ['1'])
      ->find();
---
SELECT `peminjaman`.*, `user`.`fullname`, `user`.`username`, `buku`.`judul`
FROM `peminjaman`
JOIN `buku` ON `buku`.`id` = `peminjaman`.`buku_id`
JOIN `user` ON `user`.`id` = `peminjaman`.`user_id`
WHERE `status` IN ('1')
AND `peminjaman`.`deleted_at` IS NULL

  public function pengembalian()
  {
    $data = [
      'title'      => 'Pengembalian',
      'app'        => $this->app,
      'user_login' => $this->user_login,
      'pesan_ttl'  => $this->pesan_total,
    ];

    $data['pengembalian'] = $this->peminjamanM
      ->select('peminjaman.*, user.fullname, user.username, buku.judul')
      ->join('buku', 'buku.id = peminjaman.buku_id')
      ->join('user', 'user.id = peminjaman.user_id')
      ->whereIn('status', ['2'])
      ->find();
---
SELECT `peminjaman`.*, `user`.`fullname`, `user`.`username`, `buku`.`judul`
FROM `peminjaman`
JOIN `buku` ON `buku`.`id` = `peminjaman`.`buku_id`
JOIN `user` ON `user`.`id` = `peminjaman`.`user_id`
WHERE `status` IN ('2')
AND `peminjaman`.`deleted_at` IS NULL