app/Controllers/Auth.php

  public function login()
  {
    $form = $this->request->getPost();
    $data = [
      'title' => 'Sign-in',
      'app'  => $this->app,
    ];
    if (empty($form)) {
      return view('page/login', $data);
    }

    $user_data = $this->userM->where('username', $form['username'])->first();
---
SELECT *
FROM `user`
WHERE `username` = 'admin'
AND `user`.`deleted_at` IS NULL
 LIMIT 1